#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.tfe_workspace.tfe_organization_membership.org_members["bob@example.com"] will be created
  + resource "tfe_organization_membership" "org_members" {
      + email   = "bob@example.com"
      + id      = (known after apply)
      + user_id = (known after apply)
    }

  # module.tfe_workspace.tfe_organization_membership.org_members["cho@example.com"] will be created
  + resource "tfe_organization_membership" "org_members" {
      + email   = "cho@example.com"
      + id      = (known after apply)
      + user_id = (known after apply)
    }

  # module.tfe_workspace.tfe_organization_membership.org_members["sally@example.com"] will be created
  + resource "tfe_organization_membership" "org_members" {
      + email   = "sally@example.com"
      + id      = (known after apply)
      + user_id = (known after apply)
    }

  # module.tfe_workspace.tfe_team.teams["app1-developers"] will be created
  + resource "tfe_team" "teams" {
      + id         = (known after apply)
      + name       = "app1-developers"
      + visibility = "organization"

      + organization_access {
          + manage_policies         = (known after apply)
          + manage_policy_overrides = (known after apply)
          + manage_vcs_settings     = (known after apply)
          + manage_workspaces       = (known after apply)
        }
    }

  # module.tfe_workspace.tfe_team.teams["org_admins"] will be created
  + resource "tfe_team" "teams" {
      + id         = (known after apply)
      + name       = "org_admins"
      + visibility = "secret"

      + organization_access {
          + manage_policies         = true
          + manage_policy_overrides = false
          + manage_vcs_settings     = true
          + manage_workspaces       = true
        }
    }

  # module.tfe_workspace.tfe_team.teams["security"] will be created
  + resource "tfe_team" "teams" {
      + id         = (known after apply)
      + name       = "security"
      + visibility = "organization"

      + organization_access {
          + manage_policies         = true
          + manage_policy_overrides = false
          + manage_vcs_settings     = false
          + manage_workspaces       = false
        }
    }

  # module.tfe_workspace.tfe_team_access.team_access["app1-aws-dev_app1-developers"] will be created
  + resource "tfe_team_access" "team_access" {
      + access       = "plan"
      + id           = (known after apply)
      + team_id      = (known after apply)
      + workspace_id = (known after apply)

      + permissions {
          + runs              = (known after apply)
          + sentinel_mocks    = (known after apply)
          + state_versions    = (known after apply)
          + variables         = (known after apply)
          + workspace_locking = (known after apply)
        }
    }

  # module.tfe_workspace.tfe_team_access.team_access["app1-aws-dev_org_admins"] will be created
  + resource "tfe_team_access" "team_access" {
      + access       = "admin"
      + id           = (known after apply)
      + team_id      = (known after apply)
      + workspace_id = (known after apply)

      + permissions {
          + runs              = (known after apply)
          + sentinel_mocks    = (known after apply)
          + state_versions    = (known after apply)
          + variables         = (known after apply)
          + workspace_locking = (known after apply)
        }
    }

  # module.tfe_workspace.tfe_team_access.team_access["app1-aws-dev_security"] will be created
  + resource "tfe_team_access" "team_access" {
      + access       = "read"
      + id           = (known after apply)
      + team_id      = (known after apply)
      + workspace_id = (known after apply)

      + permissions {
          + runs              = (known after apply)
          + sentinel_mocks    = (known after apply)
          + state_versions    = (known after apply)
          + variables         = (known after apply)
          + workspace_locking = (known after apply)
        }
    }

  # module.tfe_workspace.tfe_team_access.team_access["app1-aws-staging_app1-developers"] will be created
  + resource "tfe_team_access" "team_access" {
      + access       = "plan"
      + id           = (known after apply)
      + team_id      = (known after apply)
      + workspace_id = (known after apply)

      + permissions {
          + runs              = (known after apply)
          + sentinel_mocks    = (known after apply)
          + state_versions    = (known after apply)
          + variables         = (known after apply)
          + workspace_locking = (known after apply)
        }
    }

  # module.tfe_workspace.tfe_team_access.team_access["app1-aws-staging_org_admins"] will be created
  + resource "tfe_team_access" "team_access" {
      + access       = "admin"
      + id           = (known after apply)
      + team_id      = (known after apply)
      + workspace_id = (known after apply)

      + permissions {
          + runs              = (known after apply)
          + sentinel_mocks    = (known after apply)
          + state_versions    = (known after apply)
          + variables         = (known after apply)
          + workspace_locking = (known after apply)
        }
    }

  # module.tfe_workspace.tfe_team_access.team_access["app1-aws-staging_security"] will be created
  + resource "tfe_team_access" "team_access" {
      + access       = "read"
      + id           = (known after apply)
      + team_id      = (known after apply)
      + workspace_id = (known after apply)

      + permissions {
          + runs              = (known after apply)
          + sentinel_mocks    = (known after apply)
          + state_versions    = (known after apply)
          + variables         = (known after apply)
          + workspace_locking = (known after apply)
        }
    }

  # module.tfe_workspace.tfe_team_organization_member.team_members["app1-developers_cho@example.com"] will be created
  + resource "tfe_team_organization_member" "team_members" {
      + id                         = (known after apply)
      + organization_membership_id = (known after apply)
      + team_id                    = (known after apply)
    }

  # module.tfe_workspace.tfe_team_organization_member.team_members["app1-developers_sally@example.com"] will be created
  + resource "tfe_team_organization_member" "team_members" {
      + id                         = (known after apply)
      + organization_membership_id = (known after apply)
      + team_id                    = (known after apply)
    }

  # module.tfe_workspace.tfe_team_organization_member.team_members["org_admins_bob@example.com"] will be created
  + resource "tfe_team_organization_member" "team_members" {
      + id                         = (known after apply)
      + organization_membership_id = (known after apply)
      + team_id                    = (known after apply)
    }

  # module.tfe_workspace.tfe_workspace.workspaces["app1-aws-dev"] will be created
  + resource "tfe_workspace" "workspaces" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + description                   = "No description provided."
      + execution_mode                = "remote"
      + file_triggers_enabled         = true
      + global_remote_state           = (known after apply)
      + id                            = (known after apply)
      + name                          = "app1-aws-dev"
      + operations                    = (known after apply)
      + queue_all_runs                = true
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "app1",
          + "development",
        ]
      + terraform_version             = "1.1.0"
    }

  # module.tfe_workspace.tfe_workspace.workspaces["app1-aws-prod"] will be created
  + resource "tfe_workspace" "workspaces" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + description                   = "Production workspace for App 1"
      + execution_mode                = "remote"
      + file_triggers_enabled         = true
      + global_remote_state           = (known after apply)
      + id                            = (known after apply)
      + name                          = "app1-aws-prod"
      + operations                    = (known after apply)
      + queue_all_runs                = true
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "app1",
          + "prod",
        ]
      + terraform_version             = "1.1.0"
    }

  # module.tfe_workspace.tfe_workspace.workspaces["app1-aws-staging"] will be created
  + resource "tfe_workspace" "workspaces" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + description                   = "Staging workspace for App 1"
      + execution_mode                = "remote"
      + file_triggers_enabled         = true
      + global_remote_state           = (known after apply)
      + id                            = (known after apply)
      + name                          = "app1-aws-staging"
      + operations                    = (known after apply)
      + queue_all_runs                = true
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = (known after apply)
      + terraform_version             = "~> 1.0"
    }

Plan: 18 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + teamid_list = {
      + app1-developers = (known after apply)
      + org_admins      = (known after apply)
      + security        = (known after apply)
    }
  + userid_list = {
      + "bob@example.com"   = (known after apply)
      + "cho@example.com"   = (known after apply)
      + "sally@example.com" = (known after apply)
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Kostua, Action: `pull_request`*